import { JSX } from 'preact';
import { Link } from 'preact-router/match';

import logo from '../../../assets/myrotvorets.svg';
import '../static.scss';

export default function About(): JSX.Element {
    return (
        <section className="static block block--centered">
            <header className="block__header">Про Центр «Миротворець»</header>
            <img className="logo" src={logo as string} alt="Миротворець" />
            <p>
                <strong>Центр «Миротворець»</strong> є <em>незалежною недержавною організацією</em>, створеною групою
                вчених, журналістів і фахівців з питань дослідження ознак злочинів проти національної безпеки України,
                миру, безпеки людства та міжнародного правопорядку, які займаються творчою, науковою та журналістською
                діяльністю. За інформаційної підтримки Центру «Миротворець» було створено однойменний сайт, який також є
                незалежним недержавним <strong>ЗМІ (засобом масової інформації)</strong>.
            </p>
            <p>
                <strong>
                    <em>
                        В інтересах збереження життя, здоровʼя, свободи вільного пересування та інших прав і свобод
                        громадян України
                    </em>
                </strong>
                , колективом Центру «Миротворець» здійснюється фіксація та безпечне зберігання інформації щодо тих
                обʼєктів дослідження, у діях яких присутні ознаки злочинів проти національної безпеки України, життя і
                здоровʼя людини, миру, безпеки людства та міжнародного правопорядку.
            </p>
            <p>
                <strong>
                    Центр «Миротворець» здійснює свою діяльність <Link href="/about/grounds">чітко згідно</Link> з
                    чинним законодавством України і міжнародними нормативно-правовими актами, ратифікованими нашою
                    державою.
                </strong>
            </p>
            <p>
                Інформаційне наповнення сайту «Миротворець» здійснюється із загальновідомих і загальнодоступних
                відкритих джерел, які використовуються виключно в науково-дослідних, творчих і журналістських цілях.
                Основними джерелами інформації, які використовуються Центром «Миротворець» для проведення наукових
                досліджень, є відкриті для широкого загалу матеріали, що друкуються і розміщуються в соціальних мережах,
                web-виданнях, на приватних web-сторінках, на спеціалізованих форумах і блогах, транслюються на каналах
                телебачення і радіомовлення.
            </p>
            <p>
                <strong>
                    <em>
                        Центр «Миротворець» не заперечує проти використання інформації і відомостей, що містяться на
                        однойменному сайті, співробітниками СБ України, МВС України, Державної прикордонної служби
                        України, ВС України в оперативній і розшуковій діяльності.
                    </em>
                </strong>
            </p>
            <p className="clr--red fnt--bold">
                З метою виявлення обʼєктів нашого дослідження (зрадників Батьківщини, бойовиків, найманців і терористів,
                російських військовослужбовців&nbsp;— військових злочинців) на територіях інших країн, запрошуємо до
                співпраці правоохоронні органи іноземних держав.
            </p>
        </section>
    );
}
