import { h } from 'preact';

import '../static.scss';

export default function Crimes(): h.JSX.Element {
    return (
        <section className="static block block--centered">
            <header className="block__header">Квалифікація злочинів, що досліджуються Центром</header>
            <h2>КРИМІНАЛЬНИЙ КОДЕКС УКРАЇНИ</h2>
            <h3>ОСОБЛИВА ЧАСТИНА</h3>

            <section>
                <h4>Розділ I. ЗЛОЧИНИ ПРОТИ ОСНОВ НАЦІОНАЛЬНОЇ БЕЗПЕКИ УКРАЇНИ</h4>

                <article>
                    <h5>
                        Стаття 109. Дії, спрямовані на насильницьку зміну чи повалення конституційного ладу або на
                        захоплення державної влади
                    </h5>
                    <ol>
                        <li>
                            Дії, вчинені з метою насильницької зміни чи повалення конституційного ладу або захоплення
                            державної влади, а також змова про вчинення таких дій, -караються позбавленням волі на строк
                            від пʼяти до десяти років з конфіскацією майна або без такої.
                        </li>
                        <li>
                            Публічні заклики до насильницької зміни чи повалення конституційного ладу або до захоплення
                            державної влади, а також розповсюдження матеріалів із закликами до вчинення таких дій, -
                            караються обмеженням волі на строк до трьох років або позбавленням волі на той самий строк з
                            конфіскацією майна або без такої.
                        </li>
                        <li>
                            Дії, передбачені частиною другою цієї статті, вчинені особою, яка є представником влади, або
                            повторно, або організованою групою, або з використанням засобів масової інформації,
                            -караються обмеженням волі на строк до п’яти років або позбавленням волі на той самий строк
                            з конфіскацією майна або без такої.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>Стаття 110. Посягання на територіальну цілісність і недоторканність України</h5>
                    <ol>
                        <li>
                            Умисні дії, вчинені з метою зміни меж території або державного кордону України на порушення
                            порядку, встановленого Конституцією України, а також публічні заклики чи розповсюдження
                            матеріалів із закликами до вчинення таких дій, - караються позбавленням волі на строк від
                            трьох до п’яти років з конфіскацією майна або без такої.
                        </li>
                        <li>
                            Ті самі дії, якщо вони вчинені особою, яка є представником влади, або повторно, або за
                            попередньою змовою групою осіб, або поєднані з розпалюванням національної чи релігійної
                            ворожнечі, - караються позбавленням волі на строк від п’яти до десяти років з конфіскацією
                            майна або без такої.
                        </li>
                        <li>
                            Дії, передбачені частинами першою або другою цієї статті, які призвели до загибелі людей або
                            інших тяжких наслідків, - караються позбавленням волі на строк від десяти до п’ятнадцяти
                            років або довічним позбавленням волі з конфіскацією майна або без такої.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>
                        Стаття 110-2. Фінансування дій, вчинених з метою насильницької зміни чи повалення
                        конституційного ладу або захоплення державної влади, зміни меж території або державного кордону
                        України
                    </h5>
                    <ol>
                        <li>
                            Фінансування дій, вчинених з метою зміни меж території або державного кордону України на
                            порушення порядку, встановленого Конституцією України, - карається позбавленням волі на
                            строк від трьох до п’яти років з позбавленням права обіймати певні посади або займатися
                            певною діяльністю на строк до двох років та з конфіскацією майна.
                        </li>
                        <li>
                            Фінансування дій, вчинених з метою насильницької зміни чи повалення конституційного ладу або
                            захоплення державної влади, -карається позбавленням волі на строк від п’яти до семи років з
                            позбавленням права обіймати певні посади або займатися певною діяльністю на строк до двох
                            років та з конфіскацією майна.
                        </li>
                        <li>
                            Дії, передбачені частинами першою або другою цієї статті, вчинені повторно або з корисливих
                            мотивів, або за попередньою змовою групою осіб, або у великому розмірі, або якщо вони
                            призвели до заподіяння значної майнової шкоди, -караються позбавленням волі на строк від
                            шести до восьми років з позбавленням права обіймати певні посади або займатися певною
                            діяльністю на строк до трьох років та з конфіскацією майна.
                        </li>
                        <li>
                            Дії, передбачені частинами першою або другою цієї статті, вчинені організованою групою чи в
                            особливо великому розмірі, або якщо вони призвели до інших тяжких наслідків, - караються
                            позбавленням волі на строк від восьми до десяти років з позбавленням права обіймати певні
                            посади або займатися певною діяльністю на строк до трьох років та з конфіскацією майна.
                        </li>
                        <li>
                            Особа, крім керівника організованої групи, звільняється від кримінальної відповідальності за
                            дії, передбачені цією статтею, якщо вона до повідомлення їй про підозру у вчиненні нею
                            злочину добровільно заявила про те, що сталося, органу, службова особа якого наділена
                            законом правом повідомляти про підозру, про відповідну незаконну діяльність або іншим чином
                            сприяла її припиненню або запобіганню злочину, який вона фінансувала або вчиненню якого
                            сприяла, за умови, що в її діях немає складу іншого злочину.
                        </li>
                    </ol>
                    <p>
                        <em>Примітка.</em>
                    </p>
                    <ol>
                        <li>
                            Фінансуванням дій, передбачених у цій статті, є дії, вчинені з метою їх фінансового або
                            матеріального забезпечення.
                        </li>
                        <li>
                            Фінансування дій, вчинених з метою насильницької зміни чи повалення конституційного ладу або
                            захоплення державної влади, зміни меж території або державного кордону України, визнається
                            вчиненим у великому розмірі, якщо розмір фінансового або матеріального забезпечення
                            перевищує шість тисяч неоподатковуваних мінімумів доходів громадян.
                        </li>
                        <li>
                            Фінансування дій, вчинених з метою насильницької зміни чи повалення конституційного ладу або
                            захоплення державної влади, зміни меж території або державного кордону України, визнається
                            вчиненим в особливо великому розмірі, якщо розмір фінансового або матеріального забезпечення
                            перевищує вісімнадцять тисяч неоподатковуваних мінімумів доходів громадян.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>Стаття 111. Державна зрада</h5>
                    <ol>
                        <li>
                            Державна зрада, тобто діяння, умисно вчинене громадянином України на шкоду суверенітетові,
                            територіальній цілісності та недоторканності, обороноздатності, державній, економічній чи
                            інформаційній безпеці України: перехід на бік ворога в умовах воєнного стану або в період
                            збройного конфлікту, шпигунство, надання іноземній державі, іноземній організації або їх
                            представникам допомоги в проведенні підривної діяльності проти України, - карається
                            позбавленням волі на строк від дванадцяти до п’ятнадцяти років з конфіскацією майна або без
                            такої.
                        </li>
                        <li>
                            Звільняється від кримінальної відповідальності громадянин України, якщо він на виконання
                            злочинного завдання іноземної держави, іноземної організації або їх представників ніяких дій
                            не вчинив і добровільно заявив органам державної влади про свій звʼязок з ними та про
                            отримане завдання.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>Стаття 113. Диверсія</h5>
                    <p>
                        Вчинення з метою ослаблення держави вибухів, підпалів або інших дій, спрямованих на масове
                        знищення людей, заподіяння тілесних ушкоджень чи іншої шкоди їхньому здоровʼю, на зруйнування
                        або пошкодження обʼєктів, які мають важливе народногосподарське чи оборонне значення, а також
                        вчинення з тією самою метою дій, спрямованих на радіоактивне забруднення, масове отруєння,
                        поширення епідемій, епізоотій чи епіфітотій, - карається позбавленням волі на строк від десяти
                        до п’ятнадцяти років з конфіскацією майна або без такої.
                    </p>
                </article>

                <article>
                    <h5>Стаття 114. Шпигунство</h5>
                    <ol>
                        <li>
                            Передача або збирання з метою передачі іноземній державі, іноземній організації або їх
                            представникам відомостей, що становлять державну таємницю, якщо ці дії вчинені іноземцем або
                            особою без громадянства, - караються позбавленням волі на строк від десяти до п’ятнадцяти
                            років з конфіскацією майна або без такої.
                        </li>
                        <li>
                            Звільняється від кримінальної відповідальності особа, яка припинила діяльність, передбачену
                            частиною першою цієї статті, та добровільно повідомила органи державної влади про вчинене,
                            якщо внаслідок цього і вжитих заходів було відвернено заподіяння шкоди інтересам України.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>
                        Стаття 114-1. Перешкоджання законній діяльності Збройних Сил України та інших військових
                        формувань
                    </h5>
                    <ol>
                        <li>
                            Перешкоджання законній діяльності Збройних Сил України та інших військових формувань в
                            особливий період - карається позбавленням волі на строк від п’яти до восьми років.
                        </li>
                        <li>
                            Те саме діяння, яке призвело до загибелі людей або інших тяжких наслідків, - карається
                            позбавленням волі на строк від восьми до п’ятнадцяти років.
                        </li>
                    </ol>
                </article>
            </section>

            <section>
                <h4>Розділ II. ЗЛОЧИНИ ПРОТИ ЖИТТЯ ТА ЗДОРОВʼЯ ОСОБИ</h4>

                <article>
                    <h5>Стаття 115. Умисне вбивство</h5>
                    <ol>
                        <li>
                            Вбивство, тобто умисне протиправне заподіяння смерті іншій людині, - карається позбавленням
                            волі на строк від семи до пʼятнадцяти років.
                        </li>
                        <li>
                            Умисне вбивство:
                            <ol>
                                <li>двох або більше осіб;</li>
                                <li>
                                    малолітньої дитини або жінки, яка завідомо для винного перебувала у стані
                                    вагітності;
                                </li>
                                <li>заручника або викраденої людини;</li>
                                <li>вчинене з особливою жорстокістю;</li>
                                <li>вчинене способом, небезпечним для життя багатьох осіб;</li>
                                <li>з корисливих мотивів;</li>
                                <li>з хуліганських мотивів;</li>
                                <li>
                                    особи чи її близького родича у звʼязку з виконанням цією особою службового або
                                    громадського обовʼязку;
                                </li>
                                <li>з метою приховати інший злочин або полегшити його вчинення;</li>
                                <li>
                                    поєднане із зґвалтуванням або насильницьким задоволенням статевої пристрасті
                                    неприродним способом;
                                </li>
                                <li>вчинене на замовлення;</li>
                                <li>вчинене за попередньою змовою групою осіб;</li>
                                <li>
                                    вчинене особою, яка раніше вчинила умисне вбивство, за винятком вбивства,
                                    передбаченого статтями 116-118 цього Кодексу;
                                </li>
                                <li>з мотивів расової, національної чи релігійної нетерпимості,</li>
                            </ol>
                            - карається позбавленням волі на строк від десяти до пʼятнадцяти років або довічним
                            позбавленням волі, з конфіскацією майна у випадку, передбаченому пунктом 6 частини другої
                            цієї статті.
                        </li>
                    </ol>
                </article>
            </section>

            <section>
                <h4>Розділ III. ЗЛОЧИНИ ПРОТИ ВОЛІ, ЧЕСТІ ТА ГІДНОСТІ ОСОБИ</h4>

                <article>
                    <h5>Стаття 146. Незаконне позбавлення волі або викрадення людини</h5>
                    <ol>
                        <li>
                            Незаконне позбавлення волі або викрадення людини - караються обмеженням волі на строк до
                            трьох років або позбавленням волі на той самий строк.
                        </li>
                        <li>
                            Ті самі діяння, вчинені щодо малолітнього або з корисливих мотивів, щодо двох чи більше осіб
                            або за попередньою змовою групою осіб, або способом, небезпечним для життя чи здоровʼя
                            потерпілого, або таке, що супроводжувалося заподіянням йому фізичних страждань, або із
                            застосуванням зброї, або здійснюване протягом тривалого часу, - караються обмеженням волі на
                            строк до пʼяти років або позбавленням волі на той самий строк.
                        </li>
                        <li>
                            Діяння, передбачені частинами першою або другою цієї статті, вчинені організованою групою,
                            або такі, що спричинили тяжкі наслідки, - караються позбавленням волі на строк від пʼяти до
                            десяти років.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>Стаття 147. Захоплення заручників</h5>
                    <ol>
                        <li>
                            Захоплення або тримання особи як заручника з метою спонукання родичів затриманого, державної
                            або іншої установи, підприємства чи організації, фізичної або службової особи до вчинення чи
                            утримання від вчинення будь-якої дії як умови звільнення заручника - карається позбавленням
                            волі на строк від пʼяти до восьми років.
                        </li>
                        <li>
                            Ті самі дії, якщо вони були вчинені щодо неповнолітнього або організованою групою, або були
                            поєднані з погрозою знищення людей, або такі, що спричинили тяжкі наслідки, - караються
                            позбавленням волі на строк від семи до пʼятнадцяти років.
                        </li>
                    </ol>
                </article>
            </section>

            <section>
                <h4>Розділ IX. ЗЛОЧИНИ ПРОТИ ГРОМАДСЬКОЇ БЕЗПЕКИ</h4>

                <article>
                    <h5>Стаття 255. Створення злочинної організації</h5>
                    <ol>
                        <li>
                            Створення злочинної організації з метою вчинення тяжкого чи особливо тяжкого злочину, а
                            також керівництво такою організацією або участь у ній, або участь у злочинах, вчинюваних
                            такою організацією, а також організація, керівництво чи сприяння зустрічі (сходці)
                            представників злочинних організацій або організованих груп для розроблення планів і умов
                            спільного вчинення злочинів, матеріального забезпечення злочинної діяльності чи координації
                            дій обʼєднань злочинних організацій або організованих груп - караються позбавленням волі на
                            строк від пʼяти до дванадцяти років.
                        </li>
                        <li>
                            Звільняється від кримінальної відповідальності особа, крім організатора або керівника
                            злочинної організації, за вчинення злочину, передбаченого частиною першою цієї статті, якщо
                            вона добровільно заявила про створення злочинної організації або участь у ній та активно
                            сприяла її розкриттю.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>Стаття 256. Сприяння учасникам злочинних організацій та укриття їх злочинної діяльності</h5>
                    <ol>
                        <li>
                            Заздалегідь не обіцяне сприяння учасникам злочинних організацій та укриття їх злочинної
                            діяльності шляхом надання приміщень, сховищ, транспортних засобів, інформації, документів,
                            технічних пристроїв, грошей, цінних паперів, а також заздалегідь не обіцяне здійснення інших
                            дій по створенню умов, які сприяють їх злочинній діяльності, - караються позбавленням волі
                            на строк від трьох до пʼяти років.
                        </li>
                        <li>
                            Ті самі дії, вчинені службовою особою або повторно, - караються позбавленням волі на строк
                            від пʼяти до десяти років із позбавленням права обіймати певні посади чи займатися певною
                            діяльністю на строк до трьох років.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>Стаття 257. Бандитизм</h5>
                    <p>
                        Організація озброєної банди з метою нападу на підприємства, установи, організації чи на окремих
                        осіб, а також участь у такій банді або у вчинюваному нею нападі - караються позбавленням волі на
                        строк від пʼяти до пʼятнадцяти років з конфіскацією майна.
                    </p>
                </article>

                <article>
                    <h5>Стаття 258. Терористичний акт</h5>
                    <ol>
                        <li>
                            Терористичний акт, тобто застосування зброї, вчинення вибуху, підпалу чи інших дій, які
                            створювали небезпеку для життя чи здоровʼя людини або заподіяння значної майнової шкоди чи
                            настання інших тяжких наслідків, якщо такі дії були вчинені з метою порушення громадської
                            безпеки, залякування населення, провокації воєнного конфлікту, міжнародного ускладнення, або
                            з метою впливу на прийняття рішень чи вчинення або невчинення дій органами державної влади
                            чи органами місцевого самоврядування, службовими особами цих органів, обʼєднаннями громадян,
                            юридичними особами, або привернення уваги громадськості до певних політичних, релігійних чи
                            інших поглядів винного (терориста), а також погроза вчинення зазначених дій з тією самою
                            метою - караються позбавленням волі на строк від пʼяти до десяти років з конфіскацією майна
                            або без такої.
                        </li>
                        <li>
                            Ті самі дії, вчинені повторно або за попередньою змовою групою осіб, або якщо вони призвели
                            до заподіяння значної майнової шкоди чи інших тяжких наслідків, - караються позбавленням
                            волі на строк від семи до дванадцяти років з конфіскацією майна або без такої.
                        </li>
                        <li>
                            Дії, передбачені частинами першою або другою цієї статті, що призвели до загибелі людини, -
                            караються позбавленням волі на строк від десяти до пʼятнадцяти років або довічним
                            позбавленням волі з конфіскацією майна або без такої.
                        </li>
                        <li>
                            Особа звільняється від кримінальної відповідальності за діяння, передбачене частиною першою
                            цієї статті в частині погрози вчинення терористичного акту, якщо вона до повідомлення їй про
                            підозру у вчиненні нею злочину добровільно повідомила правоохоронний орган про цей злочин,
                            сприяла його припиненню або розкриттю, у разі якщо внаслідок цього і вжитих заходів було
                            відвернено небезпеку для життя чи здоров’я людини або заподіяння значної майнової шкоди чи
                            настання інших тяжких наслідків, якщо в її діях немає складу іншого злочину.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>Стаття 258-1. Втягнення у вчинення терористичного акту</h5>
                    <ol>
                        <li>
                            Втягнення особи у вчинення терористичного акту або примушування до вчинення терористичного
                            акту з використанням обману, шантажу, уразливого стану особи, або із застосуванням чи
                            погрозою застосування насильства - карається позбавленням волі на строк від трьох до пʼяти
                            років з конфіскацією майна або без такої.
                        </li>
                        <li>
                            Дії, передбачені частиною першою цієї статті, вчинені щодо кількох осіб або повторно, або за
                            попередньою змовою групою осіб, або службовою особою з використанням службового становища, -
                            караються позбавленням волі на строк від чотирьох до семи років з конфіскацією майна або без
                            такої.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>Стаття 258-1. Публічні заклики до вчинення терористичного акту</h5>
                    <ol>
                        <li>
                            Публічні заклики до вчинення терористичного акту, а також розповсюдження, виготовлення чи
                            зберігання з метою розповсюдження матеріалів з такими закликами - караються виправними
                            роботами на строк до двох років або арештом на строк до шести місяців, або обмеженням волі
                            на строк до трьох років, або позбавленням волі на той самий строк з конфіскацією майна або
                            без такої.
                        </li>
                        <li>
                            Ті самі дії, вчинені з використанням засобів масової інформації, - караються обмеженням волі
                            на строк до чотирьох років або позбавленням волі на строк до пʼяти років з позбавленням
                            права обіймати певні посади або займатися певною діяльністю на строк до трьох років та з
                            конфіскацією майна або без такої.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>Стаття 258-3. Створення терористичної групи чи терористичної організації</h5>
                    <ol>
                        <li>
                            Створення терористичної групи чи терористичної організації, керівництво такою групою чи
                            організацією або участь у ній, а так само організаційне чи інше сприяння створенню або
                            діяльності терористичної групи чи терористичної організації - караються позбавленням волі на
                            строк від восьми до пʼятнадцяти років з конфіскацією майна або без такої.
                        </li>
                        <li>
                            Звільняється від кримінальної відповідальності за діяння, передбачене частиною першою цієї
                            статті, особа, крім організатора і керівника терористичної групи чи терористичної
                            організації, яка добровільно повідомила правоохоронний орган про відповідну терористичну
                            діяльність, сприяла її припиненню або розкриттю злочинів, вчинених у звʼязку із створенням
                            або діяльністю такої групи чи організації, якщо в її діях немає складу іншого злочину.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>Стаття 258-4. Сприяння вчиненню терористичного акту</h5>
                    <ol>
                        <li>
                            Вербування, озброєння, навчання особи з метою вчинення терористичного акту, а так само
                            використання особи з цією метою - караються позбавленням волі на строк від трьох до восьми
                            років з конфіскацією майна або без такої.
                        </li>
                        <li>
                            Ті самі дії, вчинені щодо кількох осіб або повторно, або за попередньою змовою групою осіб,
                            або службовою особою з використанням свого службового становища, - караються позбавленням
                            волі на строк від пʼяти до десяти років з конфіскацією майна або без такої.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>Стаття 258-5. Фінансування тероризму</h5>
                    <ol>
                        <li>
                            Фінансування тероризму, тобто дії, вчинені з метою фінансового або матеріального
                            забезпечення окремого терориста чи терористичної групи (організації), організації,
                            підготовки або вчинення терористичного акту, втягнення у вчинення терористичного акту,
                            публічних закликів до вчинення терористичного акту, сприяння вчиненню терористичного акту,
                            створення терористичної групи (організації), - караються позбавленням волі на строк від
                            пʼяти до восьми років з позбавленням права обіймати певні посади або займатися певною
                            діяльністю на строк до двох років та з конфіскацією майна.
                        </li>
                        <li>
                            Ті самі дії, вчинені повторно або з корисливих мотивів, або за попередньою змовою групою
                            осіб, або у великому розмірі, або якщо вони призвели до заподіяння значної майнової шкоди, -
                            караються позбавленням волі на строк від восьми до десяти років з позбавленням права
                            обіймати певні посади або займатися певною діяльністю на строк до трьох років та з
                            конфіскацією майна.
                        </li>
                        <li>
                            Дії, передбачені частинами першою або другою цієї статті, вчинені організованою групою чи в
                            особливо великому розмірі, або якщо вони призвели до інших тяжких наслідків, - караються
                            позбавленням волі на строк від десяти до дванадцяти років з позбавленням права обіймати
                            певні посади або займатися певною діяльністю на строк до трьох років та з конфіскацією
                            майна.
                        </li>
                        <li>
                            Особа, крім організатора або керівника терористичної групи (організації), звільняється від
                            кримінальної відповідальності за дії, передбачені цією статтею, якщо вона добровільно до
                            притягнення до кримінальної відповідальності повідомила про відповідну терористичну
                            діяльність або іншим чином сприяла її припиненню або запобіганню злочину, який вона
                            фінансувала або вчиненню якого сприяла, за умови, що в її діях немає складу іншого злочину.
                        </li>
                    </ol>

                    <p>
                        <em>Примітка.</em>
                    </p>
                    <ol>
                        <li>
                            Фінансування тероризму визнається вчиненим у великому розмірі, якщо розмір фінансового або
                            матеріального забезпечення перевищує шість тисяч неоподатковуваних мінімумів доходів
                            громадян.
                        </li>
                        <li>
                            Фінансування тероризму визнається вчиненим в особливо великому розмірі, якщо розмір
                            фінансового або матеріального забезпечення перевищує вісімнадцять тисяч неоподатковуваних
                            мінімумів доходів громадян.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>Стаття 260. Створення не передбачених законом воєнізованих або збройних формувань</h5>
                    <ol>
                        <li>
                            Створення не передбачених законами України воєнізованих формувань або участь у їх діяльності
                            - карається позбавленням волі на строк від двох до пʼяти років з конфіскацією майна або без
                            такої.
                        </li>
                        <li>
                            Створення не передбачених законом збройних формувань або участь у їх діяльності - карається
                            позбавленням волі на строк від трьох до восьми років з конфіскацією майна або без такої.
                        </li>
                        <li>
                            Керівництво зазначеними в частинах першій або другій цієї статті формуваннями, їх
                            фінансування, постачання їм зброї, боєприпасів, вибухових речовин чи військової техніки -
                            караються позбавленням волі на строк від пʼяти до десяти років з конфіскацією майна або без
                            такої.
                        </li>
                        <li>
                            Участь у складі передбачених частинами першою або другою цієї статті формувань у нападі на
                            підприємства, установи, організації чи на громадян - карається позбавленням волі на строк
                            від семи до дванадцяти років з конфіскацією майна або без такої.
                        </li>
                        <li>
                            Діяння, передбачене частиною четвертою цієї статті, що призвело до загибелі людей чи інших
                            тяжких наслідків, - карається позбавленням волі на строк від десяти до пʼятнадцяти років з
                            конфіскацією майна або без такої.
                        </li>
                        <li>
                            Звільняється від кримінальної відповідальності за цією статтею особа, яка перебувала в
                            складі зазначених у цій статті формувань, за дії, передбачені частинами першою або другою
                            цієї статті, якщо вона добровільно вийшла з такого формування і повідомила про його
                            існування органи державної влади чи органи місцевого самоврядування.
                        </li>
                    </ol>

                    <p>
                        <em>Примітка.</em>
                    </p>
                    <ol>
                        <li>
                            Під воєнізованими слід розуміти формування, які мають організаційну структуру військового
                            типу, а саме: єдиноначальність, підпорядкованість та дисципліну, і в яких проводиться
                            військова або стройова чи фізична підготовка.
                        </li>
                        <li>
                            Під збройними формуваннями слід розуміти воєнізовані групи, які незаконно мають на озброєнні
                            придатну для використання вогнепальну, вибухову чи іншу зброю.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>
                        Стаття 261. Напад на обʼєкти, на яких є предмети, що становлять підвищену небезпеку для оточення
                    </h5>
                    <p>
                        Напад на обʼєкти, на яких виготовляються, зберігаються, використовуються або якими
                        транспортуються радіоактивні, хімічні, біологічні чи вибухонебезпечні матеріали, речовини,
                        предмети, з метою захоплення, пошкодження або знищення цих обʼєктів - карається позбавленням
                        волі на строк від пʼяти до дванадцяти років з конфіскацією майна або без такої.
                    </p>
                </article>

                <article>
                    <h5>Стаття 332. Незаконне переправлення осіб через державний кордон України</h5>
                    <ol>
                        <li>
                            Незаконне переправлення осіб через державний кордон України, організація незаконного
                            переправлення осіб через державний кордон України, керівництво такими діями або сприяння їх
                            вчиненню порадами, вказівками, наданням засобів або усуненням перешкод — караються
                            позбавленням волі на строк від трьох до пʼяти років.
                        </li>
                        <li>
                            Ті самі дії, вчинені способом, небезпечним для життя чи здоровʼя особи, яку незаконно
                            переправляли через державний кордон України, чи вчинені щодо кількох осіб, або повторно, або
                            за попередньою змовою групою осіб, або службовою особою з використанням службового
                            становища, — караються позбавленням волі на строк від пʼяти до семи років з позбавленням
                            права обіймати певні посади чи займатися певною діяльністю на строк до трьох років.
                        </li>
                        <li>
                            Дії, передбачені частиною першою або другою цієї статті, вчинені організованою групою або
                            вчинені з корисливих мотивів, — караються позбавленням волі на строк від семи до девʼяти
                            років з позбавленням права обіймати певні посади чи займатися певною діяльністю на строк до
                            трьох років з конфіскацією майна.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>
                        Стаття 332-1. Порушення порядку в’їзду на тимчасово окуповану територію України та виїзду з неї
                    </h5>
                    <ol>
                        <li>
                            Порушення порядку в’їзду на тимчасово окуповану територію України та виїзду з неї з метою
                            заподіяння шкоди інтересам держави - караються обмеженням волі на строк до трьох років або
                            позбавленням волі на той самий строк, з конфіскацією транспортних засобів.
                        </li>
                        <li>
                            Ті самі дії, вчинені повторно або за попередньою змовою групою осіб, або службовою особою з
                            використанням службового становища, - караються позбавленням волі на строк від трьох до
                            п’яти років з позбавленням права обіймати певні посади чи займатися певною діяльністю на
                            строк до трьох років та з конфіскацією транспортних засобів.
                        </li>
                        <li>
                            Дії, передбачені частиною першою або другою цієї статті, вчинені організованою групою, -
                            караються позбавленням волі на строк від п’яти до восьми років з позбавленням права обіймати
                            певні посади чи займатися певною діяльністю на строк до трьох років та з конфіскацією
                            транспортних засобів.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>Стаття 338. Наруга над державними символами</h5>
                    <ol>
                        <li>
                            Публічна наруга над Державним Прапором України, Державним Гербом України або Державним
                            Гімном України - карається штрафом до пʼятдесяти неоподатковуваних мінімумів доходів
                            громадян або арештом на строк до шести місяців або позбавленням волі на строк до трьох
                            років.
                        </li>
                        <li>
                            Публічна наруга над офіційно встановленим або піднятим прапором чи гербом іноземної держави
                            - карається штрафом до пʼятдесяти неоподатковуваних мінімумів доходів громадян або арештом
                            на строк до шести місяців або позбавленням волі на строк до двох років.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>Стаття 408. Дезертирство</h5>
                    <ol>
                        <li>
                            Дезертирство, тобто самовільне залишення військової частини або місця служби з метою
                            ухилитися від військової служби, а також незʼявлення з тією самою метою на службу у разі
                            призначення, переведення, з відрядження, відпустки або з лікувального закладу - караються
                            позбавленням волі на строк від двох до пʼяти років.
                        </li>
                        <li>
                            Дезертирство із зброєю або за попередньою змовою групою осіб - карається позбавленням волі
                            на строк від пʼяти до десяти років.
                        </li>
                        <li>
                            Діяння, передбачене частинами першою або другою цієї статті, вчинене в умовах воєнного стану
                            або в бойовій обстановці, - карається позбавленням волі на строк від пʼяти до дванадцяти
                            років.
                        </li>
                    </ol>
                </article>
            </section>

            <section>
                <h4>Розділ XX. ЗЛОЧИНИ ПРОТИ МИРУ, БЕЗПЕКИ ЛЮДСТВА ТА МІЖНАРОДНОГО ПРАВОПОРЯДКУ</h4>

                <article>
                    <h5>Стаття 436. Пропаганда війни</h5>
                    <p>
                        Публічні заклики до агресивної війни або до розвʼязування воєнного конфлікту, а також
                        виготовлення матеріалів із закликами до вчинення таких дій з метою їх розповсюдження або
                        розповсюдження таких матеріалів - караються виправними роботами на строк до двох років або
                        арештом на строк до шести місяців, або позбавленням волі на строк до трьох років.
                    </p>
                </article>

                <article>
                    <h5>
                        Стаття 436-1. Публічне заперечення чи виправдання злочинів фашизму, пропаганда неонацистської
                        ідеології, виготовлення та (або) розповсюдження матеріалів, у яких виправдовуються злочини
                        фашистів і їх прибічників
                    </h5>
                    <p>
                        Публічне заперечення чи виправдання злочинів фашизму проти людяності, вчинених у роки Другої
                        світової війни, зокрема злочинів, здійснених організацією «Вафен-СС», підпорядкованими їй
                        структурами, тими, хто боровся проти антигітлерівської коаліції і співробітничав з фашистськими
                        окупантами, а також пропаганда неонацистської ідеології, виготовлення та (або) розповсюдження
                        матеріалів, у яких виправдовуються злочини фашистів і їх прибічників, - карається штрафом від
                        п’ятисот до тисячі неоподатковуваних мінімумів доходів громадян або обмеженням волі на строк до
                        двох років, або позбавленням волі на той самий строк.
                    </p>
                </article>

                <article>
                    <h5>Стаття 437. Планування, підготовка, розвʼязування та ведення агресивної війни</h5>
                    <ol>
                        <li>
                            Планування, підготовка або розвʼязування агресивної війни чи воєнного конфлікту, а також
                            участь у змові, що спрямована на вчинення таких дій, - караються позбавленням волі на строк
                            від семи до дванадцяти років.
                        </li>
                        <li>
                            Ведення агресивної війни або агресивних воєнних дій - карається позбавленням волі на строк
                            від десяти до пʼятнадцяти років.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>Стаття 438. Порушення законів та звичаїв війни</h5>
                    <ol>
                        <li>
                            Жорстоке поводження з військовополоненими або цивільним населенням, вигнання цивільного
                            населення для примусових робіт, розграбування національних цінностей на окупованій
                            території, застосування засобів ведення війни, заборонених міжнародним правом, інші
                            порушення законів та звичаїв війни, що передбачені міжнародними договорами, згода на
                            обовʼязковість яких надана Верховною Радою України, а також віддання наказу про вчинення
                            таких дій - караються позбавленням волі на строк від восьми до дванадцяти років.
                        </li>
                        <li>
                            Ті самі діяння, якщо вони поєднані з умисним вбивством, - караються позбавленням волі на
                            строк від десяти до пʼятнадцяти років або довічним позбавленням волі.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>Стаття 439. Застосування зброї масового знищення</h5>
                    <ol>
                        <li>
                            Застосування зброї масового знищення, забороненої міжнародними договорами, згода на
                            обовʼязковість яких надана Верховною Радою України, - карається позбавленням волі на строк
                            від восьми до дванадцяти років.
                        </li>
                        <li>
                            Те саме діяння, якщо воно спричинило загибель людей або інші тяжкі наслідки, - карається
                            позбавленням волі на строк від восьми до пʼятнадцяти років або довічним позбавленням волі.
                        </li>
                    </ol>
                </article>

                <article>
                    <h5>Стаття 447. Найманство</h5>
                    <ol>
                        <li>
                            Вербування, фінансування, матеріальне забезпечення, навчання найманців з метою використання
                            у збройних конфліктах інших держав або насильницьких діях, спрямованих на повалення
                            державної влади чи порушення територіальної цілісності, а також використання найманців у
                            військових конфліктах чи діях - караються позбавленням волі на строк від трьох до восьми
                            років.
                        </li>
                        <li>
                            Участь без дозволу відповідних органів державної влади у збройних конфліктах інших держав з
                            метою одержання матеріальної винагороди - карається позбавленням волі на строк від пʼяти до
                            десяти років.
                        </li>
                    </ol>
                </article>
            </section>
        </section>
    );
}
